# MONARCH MIGRATION 1994 - 2001

In [73]:
import pandas as pd
import sqlite3
import os

In [74]:
db = sqlite3.connect("Monarchs.db")

### Read CSV for each year

In [75]:
monarchs2001 = pd.read_csv("Data\Monarchs2001.csv")
monarchs2000 = pd.read_csv("Data\Monarchs2000.csv")
monarchs1999 = pd.read_csv("Data\Monarchs1999.csv")
monarchs1998 = pd.read_csv("Data\Monarchs1998.csv")
monarchs1997 = pd.read_csv("Data\Monarchs1997.csv")
monarchs1996 = pd.read_csv("Data\Monarchs1996.csv")
monarchs1995 = pd.read_csv("Data\Monarchs1995.csv")
monarchs1994 = pd.read_csv("Data\Monarchs1994.csv")

### Convert pandas to SQL table

In [76]:
monarchs2001.to_sql("Monarchs2001", db, if_exists="replace")
monarchs2000.to_sql("monarchs2000", db, if_exists="replace")
monarchs1999.to_sql("monarchs1999", db, if_exists="replace")
monarchs1998.to_sql("monarchs1998", db, if_exists="replace")
monarchs1997.to_sql("monarchs1997", db, if_exists="replace")
monarchs1996.to_sql("monarchs1996", db, if_exists="replace")
monarchs1995.to_sql("monarchs1995", db, if_exists="replace")
monarchs1994.to_sql("monarchs1994", db, if_exists="replace")

os.getcwd()

'C:\\Users\\Arink\\Desktop\\github\\CodeLou\\Monarchs'

### View Schema 
##### All CSVs have same columns (Previously cleaned in DATA folder)

In [80]:
data_type = pd.read_sql('SELECT * FROM PRAGMA_TABLE_INFO("monarchs2001")', db)
data_type

   cid            name     type  notnull dflt_value  pk
0    0           index  INTEGER        0       None   0
1    1         Tag No.     TEXT        0       None   0
2    2       Tag State     TEXT        0       None   0
3    3        Tag Date     TEXT        0       None   0
4    4    Report State     TEXT        0       None   0
5    5  Report Country     TEXT        0       None   0
6    6     Report Date     TEXT        0       None   0
7    7           Miles     REAL        0       None   0

### Combine all years

In [78]:
combine =  pd.concat([monarchs2001, monarchs2000, monarchs1999, monarchs1998, monarchs1997, monarchs1996, monarchs1995, monarchs1994], axis =0)
combine.dtypes

Tag No.           object
Tag State         object
Tag Date          object
Report State      object
Report Country    object
Report Date       object
Miles             object
dtype: object

In [57]:
state_tally = pd.read_sql('SELECT `Tag State`, COUNT(*) AS "Recovered Tags" FROM combine GROUP BY `Tag State` ORDER BY COUNT(*) DESC', db)
state_tally

DatabaseError: Execution failed on sql 'SELECT `Tag State`, COUNT(*) AS "Recovered Tags" FROM combine GROUP BY `Tag State` ORDER BY COUNT(*) DESC': no such table: combine